{
  "Header.Item1": "About Me",
  "Header.Item2": "Experience",
  "Header.Item3": "Projects",
  "Header.Item4": "Contact",
  "Header.cvBtn": "Resume",
  "Header.cvName": "Resume_Mahmadsadik_Koliya.pdf",

  "Banner.Pretitle": "Hi there! I'm",
  "Banner.Description": "a <span class='underline'>Full Stack Developer</span> with <span class='underline'>5+ years of experience</span> crafting responsive, scalable, and intuitive applications. My focus is on delivering high-quality code and creating impactful solutions using <span class='underline'>Angular</span> and <span class='underline'>Node.js</span>, with an eye for best practices and robust design standards.",
  "Banner.ActionBtn": "Let's Connect",

  "AboutMe.Title": "About Me",
  "AboutMe.Paragraphs": [
    "With <span class='underline'>5+ years of experience</span> in software development, I've taken on roles as a <span class='underline'>Frontend Developer</span>, <span class='underline'>Backend Developer</span>. I am passionate about crafting web applications that are efficient, user-friendly, and built to scale, always focusing on adding real value to the projects I work on.",
    "My expertise lies in optimizing performance, building seamless user experiences, and writing clean, reusable code. I am dedicated to delivering quality solutions and enjoy implementing system improvements and developing standards that make a lasting impact.",
    "Outside of work, I love experimenting with new tools and frameworks, building personal projects that often solve practical challenges or satisfy my curiosity.",
    "I am skilled in a range of technologies including Angular, Node.js, AWS, JavaScript (ES6+), TypeScript, RxJS, and CI/CD workflows. These tools enable me to contribute effectively to both frontend and backend development, delivering cohesive and high-performing applications."
  ],

  "About.Skills" :["Angular", "Node.js", "RxJS", "HTML & (S)CSS", "TypeScript", "JavaScript (ES6+)", "AWS", "Express", "Jasmine / Karma (TDD)", "CI/CD", "RESTful APIs", "OAuth2"],

  "Experience.Title": "Experience",
  "Experience.Jobs": [
    {
      "Tab": "Touro University",
      "Title": "Adjunct Faculty Instructor(Web Development)",
      "Date": "January 2025 - Present",
      "Description": [
        "Designed and delivered an engaging curriculum on Node.js, emphasizing real-world application development and hands-on learning.",
        "Simplified complex concepts, guiding students with basic HTML, CSS, and JavaScript knowledge to build scalable web applications.",
        "Integrated best practices for RESTful API design, Express.js frameworks, and MongoDB databases into course modules.",
        "Prepared students to tackle challenges in web application security, scalability, and performance.",
        "Leveraged Canvas LMS to create interactive and accessible course materials.",
        "Facilitated a collaborative learning environment through hybrid teaching (in-person and Zoom), promoting active participation and practical problem-solving."
      ]
    },
  {
    "Tab": "Simform",
    "Title": "Software Engineer",
    "Date": "February 2022 - May 2024",
    "Description": [
      "Led the successful migration from AngularJS to Angular 14, improving application scalability, maintainability, and overall performance.",
      "Spearheaded the integration of Micro Frontend architecture using Webpack Module Federation, enabling modular component design for smoother cross-functional collaboration.",
      "Designed and developed responsive, cross-browser compatible user interfaces, optimizing the user experience with a focus on innovation.",
      "Worked extensively with AWS services, integrating cloud solutions for application hosting, file storage, and continuous deployment pipelines, improving operational efficiency and scalability.",
      "Mentored junior developers and acted as a subject matter expert in Angular development, promoting coding best practices and high standards within the team."
    ]
  },
  {
    "Tab": "Anblicks",
    "Title": "Software Engineer",
    "Date": "July 2018 - February 2022",
    "Description": [
      "Collaborated with cross-functional teams to analyze requirements and design reusable, scalable components for complex applications.",
      "Employed component-based architecture and strong programming principles to ensure maintainable and efficient code across the project.",
      "Contributed actively in Agile ceremonies, including sprint planning and technical reviews, to align with project goals and client expectations.",
      "Provided innovative solutions for performance enhancement and UI/UX improvements, streamlining development processes and optimizing functionality."
    ]
  }
],

  "FeatureProjects.Title": "My Projects",
  "FeatureProjects.Label": "Frontend Assesment - Next.js",
  "FeatureProjects.Projects": [
    {
      "Title": "Modern Responsive UI with Next.js, Tailwind CSS & Radix UI",
      "Description": "Developed a modern, fully responsive web interface based on <span class='underline'>Figma design</span> using <span class='underline'>Next.js</span>, <span class='underline'>Tailwind CSS</span>, and <span class='underline'>Radix UI (ShadCN)</span> components. The project demonstrates a <span class='underline'>scalable approach</span> to building <span class='underline'>reusable UI layouts</span> with <span class='underline'>accessibility</span> and <span class='underline'>performance best practices</span>. Implemented <span class='underline'>sticky header</span>, <span class='underline'>custom layout wrapper</span>, and <span class='underline'>adaptive design</span> aligned with <span class='underline'>pixel-perfect Figma specifications</span>.",
      "imgs": [
        "assets/images/answeringLeagal/answerLegal1.png",
        "assets/images/answeringLeagal/answerLegal2.png",
        "assets/images/answeringLeagal/answerLegal3.png",
        "assets/images/answeringLeagal/answerLegal4.png",
        "assets/images/answeringLeagal/answerLegal5.png"
      ],
      "ghLink": "https://github.com/mahmadsadikRepositry/frontend-assignment-nextjs",
      "demoLink": "https://frontend-assignment-nextjs-ten.vercel.app/",
      "Technologies": ["Next.js", "Tailwind CSS", "Radix UI (ShadCN)"]
    }
  ],

  "OtherProjects.Title": "More Projects",
  "OtherProjects.Projects": [
    {
      "Title": "Hands Game",
      "Description": "Extended rock-paper-scissors game. A personal project developed in Angular where you play randomly against the machine. It features the use of services, interfaces, and components.",
      "imgs": ["assets/images/hands-game.png"],
      "ghLink": "https://github.com/andresjosehr/hands-game",
      "demoLink": "https://projects.andresjosehr.com/hands-game",
      "Technologies": ["Angular", "CSS GRID", "SASS", "Angular animations"]
    },
    {
      "Title": "Countries Viewer",
      "Description": "Interface that consumes a countries API where you can view a list of countries, see details of each country, filter by name and region. It also has a dark mode to switch between dark and light themes.",
      "imgs": ["assets/images/countries-viewer.png"],
      "ghLink": "https://github.com/andresjosehr/countries-viewer",
      "demoLink": "https://projects.andresjosehr.com/countries-viewer",
      "Technologies": ["Angular", "RxJS", "SASS", "API"]
    },
    {
      "Title": "Four Card Feature Section",
      "Description": "A single page with a minimalist design listing 4 features in 4 cards. Entry animations are used with Angular animations.",
      "ghLink": "https://github.com/andresjosehr/four-card-feature-section",
      "demoLink": "https://projects.andresjosehr.com/four-card-feature-section",
      "Technologies": ["Angular", "SASS", "CSS GRID"]
    },
    {
      "Title": "Social Proof Section",
      "Description": "Personal project of a page designed from a design made in Figma. Angular was used for development along with SASS and CSS GRID.",
      "ghLink": "https://github.com/andresjosehr/social-proof-section",
      "demoLink": "https://projects.andresjosehr.com/social-proof-section",
      "Technologies": ["Angular", "CSS GRID", "GIT"]
    },
    {
      "Title": "FAQ Accordion Card",
      "Description": "Frequently asked questions accordion with logic and animations made in Angular.",
      "ghLink": "https://github.com/andresjosehr/faq-accordion",
      "demoLink": "https://projects.andresjosehr.com/faq-accordion",
      "Technologies": ["Angular", "CSS GRID", "Angular animations"]
    },
    {
      "Title": "Profile Card",
      "Description": "Simple design of a page featuring a profile card with basic information of a person.",
      "ghLink": "https://github.com/andresjosehr/profile-card-component",
      "demoLink": "https://projects.andresjosehr.com/profile-card-component",
      "Technologies": ["Angular", "SASS", "GIT"]
    }
  ],

  "Contact.Pretitle": "And... Now?",
  "Contact.Title": "Say Hi!",
  "Contact.Content": "I will be glad to hear from you if you want to discuss new opportunities. Write to me, and I will respond as soon as I see your message.",
  "Contact.Btn": "Contact Me"
}
